In [4]:
# Pandas is a popular library for data analysis
import pandas

In [5]:
import pandas as pd

In [ ]:
csv_path = 'file1.csv'
df = pd.read_csv(csv_path) # df = data frame, read_csv is from Pandas.
df.head() # by method head(), we can see the first some row of data frame

In [ ]:
xlsx_path = 'file2.xlsx' <<--- excel file
df2 = pd.read.xlsx(xlsx_path)

In [6]:
df=pd.DataFrame({'a':[11,21,31],'b':[21,22,23]})

In [8]:
df

    a   b
0  11  21
1  21  22
2  31  23

In [5]:
df.head(3) # plot the first three row of df

    a   b
0  11  21
1  21  22
2  31  23

In [6]:
df['a']  # obtain column 'a'

0    11
1    21
2    31
Name: a, dtype: int64

In [8]:
df.iloc[0,1] # in order to find element in second column and first row

21

In [19]:
df.loc[1,'b'] # Access to first row and column 'b' using name

22

In [21]:
df.loc[0:2,'a':'b'] # Slicing data frame using .loc

    a   b
0  11  21
1  21  22
2  31  23

In [9]:
df['a'].unique()   # Obtain unique elements in specific column.

array([11, 21, 31])

In [10]:
df['a']>=20

0    False
1     True
2     True
Name: a, dtype: bool

In [16]:
df3 = df[df['a']>=20]    # Return dataframe where column a is bigger than or equal to 20

In [17]:
df3

    a   b
1  21  22
2  31  23

In [24]:
df4 = df[['a']]  # Store the column 'a' of dataframe as dataframe4
df4

    a
0  11
1  21
2  31

In [ ]:
df.to_csv("file.csv")  # Save dataframe to csv file

In [18]:
df[['a','b']] # Access to multiple column

    a   b
0  11  21
1  21  22
2  31  23